[
  {
    "name": "Arya Firoozmand",
    "picture": "arya-firoozmand.png",
    "title": "Founding Partner",
    "firm_name": "L&F Brown",
    "review": "Fransisco is a wealth of knowledge when it comes to Google paid ads. I wouldn't hesitate to work with him when the stakes are high."
  },
  {
    "name": "Brooks West",
    "picture": "brooks-weest.webp",
    "title": "Founding Partner",
    "firm_name": "West Law Firm",
    "review": "I had the pleasure of receiving digital marketing guidance from Fransisco Wiles, and I was thoroughly impressed. His insights into PPC, LSA ads, and social media strategies specifically for personal injury lawyers were intelligent and practical. Fransisco offered great advice that I'm confident will significantly benefit my firm. I highly recommend his expertise!"
  },
  {
    "name": "Brett W.",
    "picture": "brett-williams.jpeg",
    "title": "Owner",
    "firm_name": "Uniqueand",
    "review": "Fransisco is the guy you want on your team. He'll come to the rescue faster than you can say \"click-through rate,\" and leave your campaigns running like a finely tuned F1 engine (just not a Ferrari engine)."
  },
  {
    "name": "Michael G.",
    "picture": "michael-g.jpeg",
    "title": "Owner",
    "firm_name": "Yerbalist",
    "review": "Sisco is a rare combination of marketing theory knowledge combined with an analytical mindset. He's an asset to my team as a media buyer and strategist."
  },
  {
    "name": "Austin Pena",
    "picture": "austin-p.jpeg",
    "title": "Owner",
    "firm_name": "GaaS",
    "review": "Fransisco is a downright incredible marketer. I can wave my hand and give some ideas of a general direction I want to go and he executes on it. Saves me time and makes me money."
  },
  {
    "name": "Julie Ann C.",
    "picture": "julie-ann.jpg",
    "title": "Search Manager",
    "firm_name": "PHOS Creative",
    "review": "Fransisco did a fantastic job walking us through his process. He had a healthy amount of research and experience from a few different industries. I really appreciated his willingness to discuss the reasons for going against any typical industry norms or advice from the advertiser platform. We're excited to apply his recommendations and move our PPC strategy to the next level!"
  },
  {
    "name": "Connor G.",
    "picture": "connor-g.jpg",
    "title": "Director of Marketing",
    "firm_name": "Encore",
    "review": "Fransisco has been such a huge help for our agency! He’s consulted for us in a time where client demands are increasing and his extensive knowledge and experience working with Google Ads has been an invaluable asset to our business."
  },
  {
    "name": "Matt B.",
    "picture": "matt-b.jpeg",
    "title": "Owner",
    "firm_name": "Case Rush Law Marketing",
    "review": "Hiring Fransisco to manage our PPC campaigns is, without a doubt, one of the best decisions I’ve made for my marketing agency. From day one, it was clear he wasn’t just going through the motions. Fransisco’s always on the ball, super responsive, and he’s always spotting new angles and ways to push our campaigns further."
  }
]
